<a href="https://colab.research.google.com/github/Anna-Tereshchuk/ETL_with_Python_and_SQL/blob/main/Window_func_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd


> Завантаження даних  з Excel файлу

In [11]:
employees = pd.read_excel('/content/H+ Sport Employees.xlsx', sheet_name='Employees-Table')



> Перегляд даних

In [12]:
print(employees.head())

      Employee Name Building Department     Status  Hire Date Month  Years  \
0        Page, Lisa     West        ADC  Full Time 1999-01-11   Jan     25
1    Taylor, Hector     West        ADC  Half-Time 2011-02-21   Feb     12
2  Dawson, Jonathan     West        ADC   Contract 2007-03-06   Mar     16
3      Duran, Brian     Taft        ADC     Hourly 2012-08-30   Aug     11
4      Weber, Larry   Watson        ADC  Full Time 2007-12-31   Dec     16

  Benefits  Salary  Job Rating  New Salary  Tax Rate  2.91%
0      DMR   24550           1         NaN       NaN    NaN
1       DM   26795           4         NaN       NaN    NaN
2      NaN   42540           5         NaN       NaN    NaN
3      NaN   35680           2         NaN       NaN    NaN
4        M   72830           2         NaN       NaN    NaN



>Вибір стовпців для видалення

In [13]:
columns_to_remove = ['Job Rating', 'New Salary', 'Tax Rate', '2.91%']



> метод `drop` для видалення зазначених стовпців

In [14]:
employees = employees.drop(columns=columns_to_remove)



> Перевірка оновленого DataFrame

In [15]:
print(employees.columns)

Index(['Employee Name', 'Building', 'Department', 'Status', 'Hire Date',
       'Month', 'Years', 'Benefits', 'Salary'],
      dtype='object')

In [26]:
from sqlalchemy import create_engine

In [27]:
DATABASE_URL = "postgresql://sql_engine_user:rzdZBwzXrwzvMAaepHFPMYXvYQQQ3431@dpg-cucb7n2j1k6c73b809lg-a.oregon-postgres.render.com/sql_engine"

# Створення підключення
engine = create_engine(DATABASE_URL)

try:
    connection = engine.connect()
    print("Успішно підключено до бази даних!")
    connection.close()
except Exception as e:
    print(f"Помилка підключення: {e}")

Успішно підключено до бази даних!

In [28]:
employees.to_sql('employees_cleaned', con=engine, if_exists='replace', index=False)
print("Дані завантажено до бази!")

Дані завантажено до бази!

**Перевірка даних у базі**

In [29]:
from sqlalchemy import text

# Перевіряємо, чи створені таблиці
with engine.connect() as conn:
    result = conn.execute(text("SELECT table_name FROM information_schema.tables WHERE table_schema = 'public';"))
    for row in result:
        print(row)

('employees_cleaned',)



> Для перевірки перших записів у таблиці

In [30]:
# Переглядаємо перші 5 записів у таблиці
with engine.connect() as conn:
    result = conn.execute(text("SELECT * FROM employees_cleaned LIMIT 5;"))
    for row in result:
        print(row)

('Page, Lisa', 'West', 'ADC', 'Full Time', datetime.datetime(1999, 1, 11, 0, 0), 'Jan', 25, 'DMR', 24550)
('Taylor, Hector', 'West', 'ADC', 'Half-Time', datetime.datetime(2011, 2, 21, 0, 0), 'Feb', 12, 'DM', 26795)
('Dawson, Jonathan', 'West', 'ADC', 'Contract', datetime.datetime(2007, 3, 6, 0, 0), 'Mar', 16, None, 42540)
('Duran, Brian', 'Taft', 'ADC', 'Hourly', datetime.datetime(2012, 8, 30, 0, 0), 'Aug', 11, None, 35680)
('Weber, Larry', 'Watson', 'ADC', 'Full Time', datetime.datetime(2007, 12, 31, 0, 0), 'Dec', 16, 'M', 72830)



> Підрахунок кількості записів

In [24]:
# Підрахунок кількості рядків у таблиці
with engine.connect() as conn:
    result = conn.execute(text("SELECT COUNT(*) FROM employees_cleaned;"))
    print("Кількість записів:", result.scalar())

Кількість записів: 741

In [39]:
query = """
SELECT column_name
FROM information_schema.columns
WHERE table_name = 'employees_cleaned';


"""

In [40]:
with engine.connect() as conn:
    result = conn.execute(text("SELECT * FROM employees_cleaned LIMIT 5;"))
    for row in result:
        print(row)

('Page, Lisa', 'West', 'ADC', 'Full Time', datetime.datetime(1999, 1, 11, 0, 0), 'Jan', 25, 'DMR', 24550)
('Taylor, Hector', 'West', 'ADC', 'Half-Time', datetime.datetime(2011, 2, 21, 0, 0), 'Feb', 12, 'DM', 26795)
('Dawson, Jonathan', 'West', 'ADC', 'Contract', datetime.datetime(2007, 3, 6, 0, 0), 'Mar', 16, None, 42540)
('Duran, Brian', 'Taft', 'ADC', 'Hourly', datetime.datetime(2012, 8, 30, 0, 0), 'Aug', 11, None, 35680)
('Weber, Larry', 'Watson', 'ADC', 'Full Time', datetime.datetime(2007, 12, 31, 0, 0), 'Dec', 16, 'M', 72830)

In [42]:
DATABASE_URL = "postgresql://sql_engine_user:rzdZBwzXrwzvMAaepHFPMYXvYQQQ3431@dpg-cucb7n2j1k6c73b809lg-a.oregon-postgres.render.com/sql_engine"
engine = create_engine(DATABASE_URL)

In [44]:
from sqlalchemy import create_engine, text

DATABASE_URL = "postgresql://sql_engine_user:rzdZBwzXrwzvMAaepHFPMYXvYQQQ3431@dpg-cucb7n2j1k6c73b809lg-a.oregon-postgres.render.com/sql_engine"
engine = create_engine(DATABASE_URL)

# List columns
with engine.connect() as conn:
    result = conn.execute(text("SELECT column_name FROM information_schema.columns WHERE table_name = 'employees_cleaned';"))
    for row in result:
        print(row)

('Salary',)
('Hire Date',)
('Years',)
('Status',)
('Benefits',)
('Month',)
('Employee Name',)
('Building',)
('Department',)

**Віконна функція `ROW_NUMBER()`**

Віконні функції дозволяють виконувати обчислення по групах рядків, які визначаються вікном. В даному випадку ми використовуємо функцію ROW_NUMBER(), яка присвоює унікальний номер кожному рядку в межах визначеного вікна.


*   `ROW_NUMBER() OVER (PARTITION BY column1 ORDER BY column2)`
*   **PARTITION BY:** Розбиває результати на групи на основі значень у вказаній колонці (в нашому випадку це “Department”).


*   **ORDER BY:** Визначає порядок сортування рядків у кожній групі (в нашому випадку це “Salary” у спадному порядку).

*   **Що робить цей запит:**


1.   **Вибирає колонки:** “Employee Name”, “Department”, “Salary”.
2.  Використовує `віконну функцію ROW_NUMBER()`

*  PARTITION BY “Department”: Розбиває результати на групи за відділами.
*   ORDER BY “Salary” DESC: Сортує кожну групу за зарплатою у спадному порядку.


3.   **Присвоює номер рядку:** Присвоює унікальний номер кожному рядку в межах кожного відділу, починаючи з 1 для найвищої зарплати.

In [46]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    ROW_NUMBER() OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as RowNum
FROM
    employees_cleaned;
"""

df_window = pd.read_sql_query(query, engine)
print(df_window)

           Employee Name          Department  Salary  rownum
0          Cameron, John  Account Management   89640       1
1    Villarreal, Stephen  Account Management   88820       2
2         Burnett, Kevin  Account Management   86500       3
3        Holloway, Chris  Account Management   85980       4
4         Herrera, Shawn  Account Management   79400       5
..                   ...                 ...     ...     ...
736      Brewer, Khurrum            Training   30445      13
737      Holland, Donald            Training   29070      14
738   Strickland, Rajean            Training   17735      15
739        Oconnor, Kent            Training   15240      16
740   Gallagher, Johnson            Training   10636      17

[741 rows x 4 columns]

**RANK()**



> Функція RANK() присвоює ранг кожному рядку в межах вікна. Якщо є однакові значення, вони отримують однаковий ранг, а наступний ранг пропускається.

In [49]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    RANK() OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as Rank
FROM
    employees_cleaned;
"""

df_rank = pd.read_sql_query(query, engine)
print(df_rank)

           Employee Name          Department  Salary  rank
0          Cameron, John  Account Management   89640     1
1    Villarreal, Stephen  Account Management   88820     2
2         Burnett, Kevin  Account Management   86500     3
3        Holloway, Chris  Account Management   85980     4
4         Herrera, Shawn  Account Management   79400     5
..                   ...                 ...     ...   ...
736      Brewer, Khurrum            Training   30445    13
737      Holland, Donald            Training   29070    14
738   Strickland, Rajean            Training   17735    15
739        Oconnor, Kent            Training   15240    16
740   Gallagher, Johnson            Training   10636    17

[741 rows x 4 columns]

**DENSE_RANK()**


> Функція DENSE_RANK() схожа на RANK(), але не пропускає ранги при однакових значеннях.

In [48]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    DENSE_RANK() OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as DenseRank
FROM
    employees_cleaned;
"""

df_dense_rank = pd.read_sql_query(query, engine)
print(df_dense_rank)

           Employee Name          Department  Salary  denserank
0          Cameron, John  Account Management   89640          1
1    Villarreal, Stephen  Account Management   88820          2
2         Burnett, Kevin  Account Management   86500          3
3        Holloway, Chris  Account Management   85980          4
4         Herrera, Shawn  Account Management   79400          5
..                   ...                 ...     ...        ...
736      Brewer, Khurrum            Training   30445         13
737      Holland, Donald            Training   29070         14
738   Strickland, Rajean            Training   17735         15
739        Oconnor, Kent            Training   15240         16
740   Gallagher, Johnson            Training   10636         17

[741 rows x 4 columns]

**NTILE()**


> Функція NTILE() розбиває результати на задану кількість груп і присвоює номер групи кожному рядку.

In [50]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    NTILE(4) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as Quartile
FROM
    employees_cleaned;
"""

df_ntile = pd.read_sql_query(query, engine)
print(df_ntile)

           Employee Name          Department  Salary  quartile
0          Cameron, John  Account Management   89640         1
1    Villarreal, Stephen  Account Management   88820         1
2         Burnett, Kevin  Account Management   86500         1
3        Holloway, Chris  Account Management   85980         1
4         Herrera, Shawn  Account Management   79400         1
..                   ...                 ...     ...       ...
736      Brewer, Khurrum            Training   30445         3
737      Holland, Donald            Training   29070         4
738   Strickland, Rajean            Training   17735         4
739        Oconnor, Kent            Training   15240         4
740   Gallagher, Johnson            Training   10636         4

[741 rows x 4 columns]

**LAG()**


> Функція LAG() дозволяє отримати значення з попереднього рядка в межах вікна.

In [51]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    LAG("Salary", 1) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as PrevSalary
FROM
    employees_cleaned;
"""

df_lag = pd.read_sql_query(query, engine)
print(df_lag)

           Employee Name          Department  Salary  prevsalary
0          Cameron, John  Account Management   89640         NaN
1    Villarreal, Stephen  Account Management   88820     89640.0
2         Burnett, Kevin  Account Management   86500     88820.0
3        Holloway, Chris  Account Management   85980     86500.0
4         Herrera, Shawn  Account Management   79400     85980.0
..                   ...                 ...     ...         ...
736      Brewer, Khurrum            Training   30445     30780.0
737      Holland, Donald            Training   29070     30445.0
738   Strickland, Rajean            Training   17735     29070.0
739        Oconnor, Kent            Training   15240     17735.0
740   Gallagher, Johnson            Training   10636     15240.0

[741 rows x 4 columns]

**LEAD()**


> Функція LEAD() дозволяє отримати значення з наступного рядка в межах вікна.

In [52]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    LEAD("Salary", 1) OVER (PARTITION BY "Department" ORDER BY "Salary" DESC) as NextSalary
FROM
    employees_cleaned;
"""

df_lead = pd.read_sql_query(query, engine)
print(df_lead)

           Employee Name          Department  Salary  nextsalary
0          Cameron, John  Account Management   89640     88820.0
1    Villarreal, Stephen  Account Management   88820     86500.0
2         Burnett, Kevin  Account Management   86500     85980.0
3        Holloway, Chris  Account Management   85980     79400.0
4         Herrera, Shawn  Account Management   79400     79380.0
..                   ...                 ...     ...         ...
736      Brewer, Khurrum            Training   30445     29070.0
737      Holland, Donald            Training   29070     17735.0
738   Strickland, Rajean            Training   17735     15240.0
739        Oconnor, Kent            Training   15240     10636.0
740   Gallagher, Johnson            Training   10636         NaN

[741 rows x 4 columns]

**SUM()**


> Функція SUM() обчислює суму значень у межах вікна.

In [53]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    SUM("Salary") OVER (PARTITION BY "Department") as TotalSalary
FROM
    employees_cleaned;
"""

df_sum = pd.read_sql_query(query, engine)
print(df_sum)

          Employee Name          Department  Salary  totalsalary
0          Lawson, Erin  Account Management   69420    4431688.0
1       Bowman, Michael  Account Management   47520    4431688.0
2      Chapman, Jessica  Account Management   45750    4431688.0
3          Hunter, Lisa  Account Management   50570    4431688.0
4        Herrera, Shawn  Account Management   79400    4431688.0
..                  ...                 ...     ...          ...
736  Gallagher, Johnson            Training   10636     870456.0
737     Phillips, Liesl            Training   85300     870456.0
738         Burton, Cam            Training   58290     870456.0
739           Rowe, Ken            Training   76690     870456.0
740     Holland, Donald            Training   29070     870456.0

[741 rows x 4 columns]

**AVG()**


> Функція AVG() обчислює середнє значення у межах вікна.

In [54]:
query = """
SELECT
    "Employee Name",
    "Department",
    "Salary",
    AVG("Salary") OVER (PARTITION BY "Department") as AvgSalary
FROM
    employees_cleaned;
"""

df_avg = pd.read_sql_query(query, engine)
print(df_avg)

          Employee Name          Department  Salary     avgsalary
0          Lawson, Erin  Account Management   69420  50360.090909
1       Bowman, Michael  Account Management   47520  50360.090909
2      Chapman, Jessica  Account Management   45750  50360.090909
3          Hunter, Lisa  Account Management   50570  50360.090909
4        Herrera, Shawn  Account Management   79400  50360.090909
..                  ...                 ...     ...           ...
736  Gallagher, Johnson            Training   10636  51203.294118
737     Phillips, Liesl            Training   85300  51203.294118
738         Burton, Cam            Training   58290  51203.294118
739           Rowe, Ken            Training   76690  51203.294118
740     Holland, Donald            Training   29070  51203.294118

[741 rows x 4 columns]